blog/index.org
#+TITLE: CtrlAltDelete.nu
#+DESCRIPTION: It's all about 42, (defn foobarbaz []) and cheeseburgers.
#+AUTHOR: Anton Erholt
#+STARTUP: indent hidestars
#+STARTUP: logdone
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+LANGUAGE:  en
#+HUGO_SECTION: blog
#+HUGO_BASE_DIR: ../
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_WEIGHT: auto

** DONE Presentation of game demo                      :game:design:
:PROPERTIES:
:EXPORT_FILE_NAME: presentation-game-demo
:EXPORT_DATE: 2013-12-13
:END:
We made a presentation of a game demo we developed during the
course [fn:9]. Here follows the script and some comments of the final
presentation (NOTE: This might be a tedious read since... Well. You
have been warned).


*** Presentation Script
*Welcome*
Hi everyone and welcome to this presentation. We’re the group “Fat
ninja” a.k.a. Kitten with Mittens. We are here to present a charming
puzzle game with...

*Description*

...an adorable Kitten. But is it so cute after all?
Kitten with Mittens is a game where you lead Cat through a series of
levels by using his moving abilities. The levels are puzzles where you
need to think and plan your route beforehand if you want to complete
the level successfully.

As you probably can tell by our awesome posters, the game is currently
available on Android and iOS platforms, but today we will be demoing
on the Windows platform (Microsoft Surface tablet) and a smart
phone. Without spoiling anything more about the game, we are going to
present a story to you.

*Story*

In a warm and cozy house, far up in icy
and cold Sweden, lives Cat the clumsy kitten.

One early winter morning, Cat is lying in a warm bed under a
blanket. Sleeping and dreaming of catnip with not a single thought of
ever going up.
- “Aaaah, this will be a lovely day of doing nothing.”

All of a sudden, Cat feels the need to scratch behind the ear. As Cat
moves the paw back-and forth on the head, Cat tries to unfold a claw
for that extra bit of OOMPH in the scratch. Cat feels that all of the
fingers are completely restrained and Cat can’t unfold them at
all. What is this?! Cat panics and tumbles over, whelps the bed over
and lands in an otherwise yummilicious bowl of morning milk.

Cat slowly lift the eyelids and discovers a pair of mittens on top of
the paws. As if that wasn’t enough, already having the morning ruined
by a non-scratched itch and immobilization of paws, Cat also discovers
a long scarf tied way too hard around the neck. What used to be a warm
kitty, soft kitty, little ball of fur - is now unhappy kitty, awake
and wet kitty, no purr, purr, purr!

Will you help Cat rid the mittens?

*Game play*
/Showed a short video of actual gameplay/

So what does the game play look like?
All-in-all you can move the cat around by swiping left or right, jump by tapping and swing by pressing and holding when near a swinging platform. These abilities can be combined in order to create mind blowing and dazzling puzzles.

*Art*
Original art hand-made by Kajsa. The cat is modeled and animated by Veronica in Blender.

*Project plan*
On time.

*Trailer, Thanks & Questions*

*** Comments About the Game

*Positive Feedback*

The first thing that struck people was how cute
and pleasing to the eyes the game was, even though it was not the most
technically advanced game presented during the seminar. The prototype
was completely made up from primitives that was at our disposal in
Unity, a self made model (the cat) from Blender and watercolour made
paintings that had been scanned in for the textures in the background
as well as the textures on walls and the ground. They really liked the
art direction as well and thought that the whole presentation
(textures, level design and models) looked consistent as a whole.

The consensus about the game mechanics and level progression itself
from the people who tried it was that it was addicting, since the
reward of clearing a stage made you want to play the game for
longer. They liked the rope mechanic too even though it is hard to
master.

Another thing that people really liked was the original oral
presentation that we made and the posters that we had put up on the
walls in the seminar room. It definitely raised interest in our
product, so from a managerial point of view it was a successful game
announcement. Finally we got some nice comments from one of the
persons from Swedish Game Awards who thought that we definitely should
participate in their event. One of his comments were that he did not
get as frustrated as he could have been when he failed to complete one
of our hard levels. He said it was because you can never count on a
kitten to behave as you want it to. We think it is a good comment,
since it is hard to say the same thing about another game.

*Constructive Criticism*

The prototype levels got very hard a little bit too fast. This is due
to us trying to cram in the rope functionality in an early stage,
which is a hard technique to master. Especially if the player is not
completely familiar with the rest of the control scheme.

People thought that the game was hard and frustrating at times due to
too few descriptions of the controls. However, that was something that
we were already aware of, but due to time constraints we did not have
enough time to implement as many “tutorial elements” in the prototype
version of the game as we would have liked.
